
test_cases = [
  {
    "user_query_ori": "что будет за дискредитацию армии рф?",
    "needed_articles": ["Статья 20.3.3."]
  },
  {
    "user_query_ori": "штраф за пересечение стоп-линии красный сигнал светофора",
    "needed_articles": ["Статья 12.12."]
  },
  {
    "user_query_ori": "какое наказание за марихуану?",
    "needed_articles": ["Статья 6.8."]
  },
  {
    "user_query_ori": "какое наказание за драку?",
    "needed_articles": ["Статья 6.1.1."]
  },
  {
    "user_query_ori": "что будет если скрыться с места дтп?",
    "needed_articles": ["Статья 12.27."]
  },
  {
    "user_query_ori": "какой штраф за просроченный паспорт?",
    "needed_articles": ["Статья 19.15."]
  },
  {
    "user_query_ori": "что будет за дачу взятки?",
    "needed_articles": ["Статья 19.28."]
  },
  {
    "user_query_ori": "что будет за вырубку леса?",
    "needed_articles": ["Статья 8.25.", "Статья 8.28."]
  },
  {
    "user_query_ori": "какой штраф за порчу чужого имущества?",
    "needed_articles": ["Статья 7.17."]
  },
  {
    "user_query_ori": "какой штраф за вождение без прав?",
    "needed_articles": ["Статья 12.7."]
  },
  {
    "user_query_ori": "что будет за неявку по повестке?",
    "needed_articles": ["Статья 27.15.", "Статья 21.5."]
  },
  {
    "user_query_ori": "что будет за тонировку?",
    "needed_articles": ["Статья 12.5."]
  },
  {
    "user_query_ori": "Что будет за дискриминацию по полу, цвету кожи, расе?",
    "needed_articles": ["Статья 5.62."]
  },
  {
    "user_query_ori": "Что будет за сокрытие ВИЧ?",
    "needed_articles": ["Статья 6.1."]
  },
  {
    "user_query_ori": "Что будет за потребление наркотических веществ",
    "needed_articles": ["Статья 20.20.", "Статья 6.9."]
  },
  {
    "user_query_ori": "Что будет за повреждение памятников культурного наследия",
    "needed_articles": ["Статья 7.13."]
  },
  {
    "user_query_ori": "какой штраф за предпринимательскую деятельность без регистрации?",
    "needed_articles": ["Статья 14.1."]
  },
  {
    "user_query_ori": "Что будет, если не уступить дорогу пешеходу?",
    "needed_articles": ["Статья 12.18."]
  }
]
